/******************************************************************************
	タイトル名：Camera
	ファイル名：camera.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/11/14
******************************************************************************/
/******************************************************************************
	インクルードファイル
******************************************************************************/
#include "main.h"
#include "camera.h"

/******************************************************************************
	関数名 : CCamera::CCamera()
	説明   : コンストラクタ
******************************************************************************/
CCamera::CCamera(void)
{
	
}

/******************************************************************************
	関数名 : CCamera::~CCamera()
	説明   : デストラクタ
******************************************************************************/
CCamera::~CCamera(void)
{
}

/******************************************************************************
	関数名 : void CCamera::Init(void)
	引数   : void
	戻り値 : なし
	説明   : 初期化処理
******************************************************************************/
void CCamera::Init(void)
{
	m_PosV = Vector3(0.0f, 250.0f, 800.0f);
	m_PosR = Vector3(0.0f, 250.0f, 0.0f);
	m_VecU = Vector3(0.0f, 1.0f, 0.0f);
	m_Rot  = Vector3(0.0f, PI, 0.0f);
	m_Distance = 100.0f;
}

/******************************************************************************
	関数名 : void CCamera::Uninit(void)
	引数   : void
	戻り値 : なし
	説明   : 終了処理
******************************************************************************/
void CCamera::Uninit(void)
{
}

/******************************************************************************
	関数名 : void CCamera::Update(void)
	引数   : void
	戻り値 : なし
	説明   : 更新処理。
******************************************************************************/
void CCamera::Update(void)
{
	//	視点の座標設定

}

/******************************************************************************
	関数名 : void CCamera::Set(void)
	引数   : void
	戻り値 : なし
	説明   : ビューマトリクス。
******************************************************************************/
void CCamera::Set(void)
{
	//	ビューポートの設定//////////////////////////////////////////
	glViewport(0, 0, SCREEN_WIDTH, SCREEN_HEIGHT);

	//	ここからプロジェクションマトリクスの設定////////////////////
	glMatrixMode(GL_PROJECTION);
	glLoadIdentity();
	gluPerspective(180.0f * 0.25f,					//視野角PI * 0.25f
		(float)SCREEN_WIDTH / (float)SCREEN_HEIGHT,	//アスペクト比, 
		1.0f,		//	near
		5000.0f);	//	far
	//	ここまでプロジェクションマトリクスの設定////////////////////

	//	ここからビューマトリクスの設定//////////////////////////////
	glMatrixMode(GL_MODELVIEW);
	glLoadIdentity();
	gluLookAt(m_PosV.x, m_PosV.y, m_PosV.z,		//	視点座標
			  m_PosR.x, m_PosR.y, m_PosR.z,		//	注視点座標
			  m_VecU.x, m_VecU.y, m_VecU.z);	//	カメラの向き
	//	ここまでビューマトリクスの設定//////////////////////////////
}

CCamera *CCamera::Create(void)
{
	CCamera *obj = new CCamera;
	obj->Init();

	return obj;
}