/******************************************************************************
	タイトル名：Camera
	ファイル名：camera.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/11/14
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス宣言
******************************************************************************/
class CCamera
{
public:
	CCamera(void);		//	コンストラクタ
	~CCamera(void);		//	デストラクタ

	void Init(void);		//	初期化関数
	void Uninit(void);		//	終了関数
	void Update(void);		//	更新関数

	void Set(void);			//	セット関数

	static CCamera *Create(void);		//	作成関数。

private:
	Vector3 m_PosV;		//	視点座標。
	Vector3 m_PosR;		//	注視点座標。
	Vector3 m_VecU;		//	カメラ上部が向いている方向。
	Vector3 m_Rot;		//	角度。
	float m_Distance;	//	視点と注視点の距離。
};

