/******************************************************************************
	タイトル名 : credit
	ファイル名 : credit.h
	作成者     : AT-13B-284 02 阿部隆
	作成日     : 2017/02/01
	更新日     : 
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	インクルードファイル
******************************************************************************/
#include "scene.h"
#include "scene2D.h"
#include "texture.h"

/******************************************************************************
	構造体宣言
******************************************************************************/
/******************************************************************************
	マクロ定義
******************************************************************************/
/******************************************************************************
	Class宣言
******************************************************************************/
// 前方宣言
class CTexture;

// クレジット画面 クラス設定
class CCredit : public CScene2D
{
	private:
		static bool m_bUse;		// フラグ

		static Vector2 m_Pos;	//	座標。
		static Vector2 m_Rot;	//	角度。
		static float m_Width;	//	横幅。
		static float m_Height;	//	縦幅。

	public:
		CCredit( int Priority = PRIORITY_2D, OBJ_TYPE objType = OBJ_TYPE_NONE );
		~CCredit();
		void Init		( Vector2 pos, Vector2 rot, float height, float width, int index );
		void Uninit		( void );
		void Draw		( void );
		void Update		( void );

		static void Start	( void );	// 画面 表示
		static void End		( void );	// 画面 非表示

		static CCredit* Create ( Vector2 pos, Vector2 rot, float height, float width, int index );

};

//==================================================================================== tutorial.hの終了