/******************************************************************************
	タイトル名：CGame_UI
	ファイル名：game_UI.cpp
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/12/05
******************************************************************************/
/******************************************************************************
	インクルードファイル
******************************************************************************/
#include "main.h"
#include "renderer.h"
#include "manager.h"
#include "texture.h"
#include "scene.h"
#include "scene2D.h"
#include "game_UI.h"

/******************************************************************************
	関数名 : CGame_UI::CGame_UI()
	説明   : コンストラクタ
******************************************************************************/
CGame_UI::CGame_UI(int Priority, OBJ_TYPE objType) : CScene2D(Priority, objType)
{
}

/******************************************************************************
	関数名 : CGame_UI::~CGame_UI()
	説明   : デストラクタ
******************************************************************************/
CGame_UI::~CGame_UI(void)
{
}

/******************************************************************************
	関数名 : void CGame_UI::Init(void)
	引数   : void
	戻り値 : なし
	説明   : 初期化処理
******************************************************************************/
void CGame_UI::Init(Vector2 pos, float width, float height, int nIdx)
{
	m_Pos = pos;
	m_Width = width;
	m_Height = height;
	m_nTexIdx = CTexture::SetTexture(nIdx);
}

/******************************************************************************
	関数名 : void CGame_UI::Uninit(void)
	引数   : void
	戻り値 : なし
	説明   : 終了処理
******************************************************************************/
void CGame_UI::Uninit(void)
{
	CScene2D::Uninit();
}

/******************************************************************************
	関数名 : void CGame_UI::Update(void)
	引数   : void
	戻り値 : なし
	説明   : 更新処理
******************************************************************************/
void CGame_UI::Update(void)
{

}

/******************************************************************************
	関数名 : void CGame_UI::Draw(void)
	引数   : void
	戻り値 : なし
	説明   : 描画処理。
******************************************************************************/
void CGame_UI::Draw(void)
{
	CScene2D::Draw();
}

/******************************************************************************
	関数名 : void CGame_UI::Create(Vector2 pos, float width, float height)
	引数   : void
	戻り値 : なし
	説明   : 描画処理。
******************************************************************************/
void CGame_UI::Create(Vector2 pos, float width, float height, int texIndex)
{
	CGame_UI *obj = new CGame_UI;
	obj->Init(pos, width, height, texIndex);
}