/******************************************************************************
	タイトル名：CGame_UI
	ファイル名：game_UI.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/12/05
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス宣言
******************************************************************************/
class CGame_UI : public CScene2D
{
public:
	CGame_UI(int Priority = PRIORITY_4, OBJ_TYPE objType = OBJ_TYPE_2D);		//	コンストラクタ。
	~CGame_UI(void);	//	デストラクタ。

	void Init(Vector2 pos, float width, float height, int texIndex);		//	初期化関数。
	void Uninit(void);		//	終了関数。
	void Update(void);		//	更新関数。
	void Draw(void);		//	描画関数。

	static void Create(Vector2 pos, float width, float height, int texIndex);
};

