/******************************************************************************
	タイトル名：Manager
	ファイル名：manager.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/11/14
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	インクルード宣言
******************************************************************************/

/******************************************************************************
	クラス宣言
******************************************************************************/
class CRerenderer;
class CManager
{
public:
	CManager(void);
	~CManager(void);

	HRESULT Init(HINSTANCE hInstance , HWND hWnd , BOOL bWindow);		//	初期化処理
	void Uninit(void);													//	終了処理
	void Update(void);													//	更新処理
	void Draw(void);													//	描画処理

	CRerenderer  *GetRenderer(void) { return m_pRenderer; }	
private:
	CRerenderer *m_pRenderer;		//	レンダラークラス。
};

