/******************************************************************************
	タイトル名：Scene3D
	ファイル名：scene3D.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2016/11/21
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	クラス宣言
******************************************************************************/
class CPlayer : public CScene3D
{
public:
	CPlayer();		//	コンストラクタ。
	~CPlayer();	//	デストラクタ。

	void Init(Vector3 pos, float width, float height);		//	初期化関数。
	void Uninit(void);		//	終了関数。
	void Update(void);		//	更新関数。
	void Draw(void);		//	描画関数

	static CPlayer *Create(Vector3 pos, float width, float height);	//	作成関数。
protected:
	CTexture *m_pTexture;	// テクスチャポインタ
};
