/******************************************************************************
	タイトル名 : rank
	ファイル名 : rank.h
	作成者     : AT-13B-284 02 阿部隆
	作成日     : 2016/12/13
	更新日     : 
******************************************************************************/
/******************************************************************************
	インクルードガード
******************************************************************************/
#pragma once

/******************************************************************************
	インクルードファイル
******************************************************************************/
#include "scene.h"
#include "scene2D.h"
#include "texture.h"

/******************************************************************************
	マクロ定義
******************************************************************************/
const int RANK_MAX = 4;	// ランクの最大数

/******************************************************************************
	型定義
******************************************************************************/

// ランクのクラス
class CRank : CScene2D
{
	private:
		// 順位の構造体
		struct RANK
		{
			Vector2 pos;		// 項目の位置
			float	fWidth;		// 項目の幅
			float	fHeight;	// 項目の高さ
			float	alfa;		// 項目のα値
		};

		RANK m_Rank[ RANK_MAX ];		// 各順位の種類
		int		m_TexIdx[ RANK_MAX ];	// 各順位の画像データのワーク
		float	m_HeightChange;			// 各順位の高さの間隔

	public:
		CRank( int Priority = PRIORITY_2D, OBJ_TYPE objType = OBJ_TYPE_NONE );
		~CRank();

		void Init		( Vector2 pos, Vector2 rot, float width, float height );
		void Uninit		( void );
		void Update		( void );
		void Draw		( void );

		static CRank *Create ( Vector2 pos, Vector2 rot, float width, float height );
};

// =================================================================================== titleMenu.hの終了