/*******************************************************************************
* タイトル名：
* ファイル名：river.h
* 作成者	：AT13B284 02 阿部隆
* 作成日	：2017/02/08
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once

#include "scene.h"
#include "scene2D.h"
#include "texture.h"

/*******************************************************************************
* クラス宣言
*******************************************************************************/
// 川クラス
class CRiver : public CScene2D
{
private:
	float m_Tex;
public:
	CRiver( int Priority = PRIORITY_2D, OBJ_TYPE objType = OBJ_TYPE_NONE );		//	コンストラクタ。
	~CRiver();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CRiver *Create( void );
};