/******************************************************************************
	タイトル名：skeleton
	ファイル名：skeleton.h
	作成者    ：AT-13B-284 35 深澤佑太
	作成日    ：2017/02/06
******************************************************************************/
/*******************************************************************************
	インクルードガード
*******************************************************************************/
#pragma once

/*******************************************************************************
	クラス宣言
*******************************************************************************/
class CSkeleton : public CEnemy
{
public:
	CSkeleton(int Priority = PRIORITY_3D, OBJ_TYPE objType = OBJ_TYPE_ENEMY);
	~CSkeleton(void);

	void Update(void);

	static void Create(Vector3 pos, float width, float height, int texIndex, int id);

private:
	float m_Movement;	//	移動スピード。
	bool m_TurnFlag;	//	振り返るフラグ。
	int m_StateCnt;		//	ステートカウンター。
};

