/******************************************************************************
* タ イ ト ル : 
* 説　　　明　: soundal.cppのヘッダファイル
* プログラム名: soundal.h
* 作　成　者　: AT-13B-284 No.31 中山和馬
* 作　成　日　: 2016/06/17
* 修　正　日　: 
* 変更履歴
* 2016/06/17  : 作成
* 著　作　権　: Copyright(c)2016 nakayama All rights reserved.
******************************************************************************/

/******************************************************************************
* 二重インクルード防止
******************************************************************************/
#ifndef _SOUNDAL_H_
#define _SOUNDAL_H_

/******************************************************************************
* インクルード宣言
******************************************************************************/
#include"main.h"
#include"alut.h"

/******************************************************************************
* ライブラリのリンク
******************************************************************************/
#pragma comment( lib, "OpenAL32.lib" )
#pragma comment( lib, "alut.lib" )

#define SOUNDBUFFERMAX ( 16 )

/******************************************************************************
* 構造体の宣言
******************************************************************************/
class CSoundAL
{
private:
	static ALuint m_nSource[ SOUNDBUFFERMAX ];
	static ALuint m_nBuffer[ SOUNDBUFFERMAX ];

public:
	CSoundAL();
	~CSoundAL();

	static void Init( void );
	static void Uninit( void );
	static void Play( int nBuffer, bool bLoop );
	static int Load( const char *filename );
	static void Stop( int nBuffer );
	static void StopAll();
};

/******************************************************************************
* プロトタイプ宣言
******************************************************************************/

#endif