/*******************************************************************************
* タイトル名：
* ファイル名：textureGL.cpp
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#ifndef _TEXTURE_H_
#define _TEXTURE_H_

/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"

/*******************************************************************************
* インクルードファイル
*******************************************************************************/

/*******************************************************************************
* マクロ定義
*******************************************************************************/

/*******************************************************************************
* 構造体
*******************************************************************************/
typedef struct                                                                          
{
	GLubyte *imageData;		//イメージデータ（３２ビットまで）                                                             
	GLuint  bpp;			//ビット/ピクセル
	GLuint  width;			//横幅                                                                   
	GLuint  height;			//高さ                                                                
	GLuint  texID;			//ID(複数使用時)                                                                  
}TextureImage;

/*******************************************************************************
* 前方宣言
*******************************************************************************/

/*******************************************************************************
* クラス宣言
*******************************************************************************/
// レンダラークラス
class CTexture
{
	private:
		unsigned int m_nTexture;
		int m_nImageSize;	// サイズ
		int m_nWidth;		// 横幅
		int m_nHeight;		// 高さ
		int m_nBpp;			// 深度
		int m_nDiscrip;		// 格納方向

		unsigned int m_Format;
		int m_nInternalFormat;
	public:
		CTexture();
		~CTexture();
		void Init( void );
		void Uninit( void );
		void Update( void );
		void Draw( void );
		void Release( void );

		unsigned int CreateTextureTGA( char *FileName );
		unsigned int CreateTextureTGAInverse( char *FileName );
		unsigned int CreateTextureBMP( char *FileName );
		//unsigned int CreateTexturePNG( char *FileName );

		int m_nId;
};

#endif

