/*******************************************************************************
* タイトル名：
* ファイル名：titlebackground.h
* 作成者	：AT13B284 02 阿部隆
* 作成日	：2016/12/05
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once

#include "scene.h"
#include "scene2D.h"
#include "texture.h"

/*******************************************************************************
* クラス宣言
*******************************************************************************/
// タイトル背景クラス
class CTitleBackground : public CScene2D
{
private:

public:
	CTitleBackground( int Priority = PRIORITY_2D, OBJ_TYPE objType = OBJ_TYPE_NONE );		//	コンストラクタ。
	~CTitleBackground();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	static CTitleBackground *Create( void );
};

