/*******************************************************************************
* タイトル名：
* ファイル名：title.h
* 作成者	：AT13B284 10 小笠原啓太
* 作成日	：2016/11/14
********************************************************************************
* 更新履歴	：
*
*******************************************************************************/
/*******************************************************************************
* インクルードガード
*******************************************************************************/
#pragma once

/*******************************************************************************
* クラス宣言
*******************************************************************************/
// 前方宣言
class CCamera;
class CTitlePlayer;

// タイトルクラス
class CTitle : public CMode
{
private:
	CCamera *m_pCamera;
	CTitlePlayer *m_pPlayer;

public:
	CTitle();
	~CTitle();
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	CCamera* GetCamera(void) { return m_pCamera; }		// カメラ取得関数
	CTitlePlayer* GetPlayer(void) { return m_pPlayer; }		// プレイヤー取得関数
};

